-------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\joshu\OneDrive\Documents\GitHub\ExperimentalEcon\Experiemental\GroupReplication.log
  log type:  text
 opened on:   2 Dec 2023, 13:35:11

. 
. 
. *Replication
. ** Helper
. ttest p1s1, by(scenario) unequal

Two-sample t test with unequal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
  no_bot |     367    .8583106    .0182285    .3492073    .8224649    .8941563
   p2bot |     372    .5860215    .0255716    .4932081     .535738    .6363051
---------+--------------------------------------------------------------------
Combined |     739    .7212449    .0165053    .4486904    .6888419    .7536479
---------+--------------------------------------------------------------------
    diff |            .2722891    .0314036                .2106276    .3339506
------------------------------------------------------------------------------
    diff = mean(no_bot) - mean(p2bot)                             t =   8.6706
H0: diff = 0                     Satterthwaite's degrees of freedom =   668.79

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. * p<0.001, identical to what was reported
. 
. ** Pushiner
. gen p3nobot = p3s1 if scenario=="no_bot"
(10,328 missing values generated)

. gen p3p1bot = p3s1 if scenario=="p1bot"
(10,332 missing values generated)

. gen p3p2bot = p3s1 if scenario=="p2bot"
(10,298 missing values generated)

. 
. ttest p3nobot == p3p1bot, unpaired

Two-sample t test with equal variances
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
 p3nobot |     369    .4498645    .0259329    .4981555    .3988692    .5008598
 p3p1bot |     365    .4054795    .0257346    .4916586    .3548723    .4560866
---------+--------------------------------------------------------------------
Combined |     734    .4277929    .0182743     .495096    .3919167    .4636692
---------+--------------------------------------------------------------------
    diff |             .044385    .0365373               -.0273454    .1161155
------------------------------------------------------------------------------
    diff = mean(p3nobot) - mean(p3p1bot)                          t =   1.2148
H0: diff = 0                                     Degrees of freedom =      732

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8876         Pr(|T| > |t|) = 0.2248          Pr(T > t) = 0.1124

. * not significant (as noted in the paper)*
. ttest p3p2bot == p3p1bot, unpaired

Two-sample t test with equal variances
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
 p3p2bot |     399    .2531328    .0217949    .4353523    .2102854    .2959803
 p3p1bot |     365    .4054795    .0257346    .4916586    .3548723    .4560866
---------+--------------------------------------------------------------------
Combined |     764    .3259162    .0169687    .4690232    .2926054     .359227
---------+--------------------------------------------------------------------
    diff |           -.1523466    .0335423               -.2181928   -.0865004
------------------------------------------------------------------------------
    diff = mean(p3p2bot) - mean(p3p1bot)                          t =  -4.5419
H0: diff = 0                                     Degrees of freedom =      762

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 1.0000

. *identical and p<0.001
. ttest p3nobot == p3p2bot, unpaired

Two-sample t test with equal variances
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
 p3nobot |     369    .4498645    .0259329    .4981555    .3988692    .5008598
 p3p2bot |     399    .2531328    .0217949    .4353523    .2102854    .2959803
---------+--------------------------------------------------------------------
Combined |     768    .3476563    .0171955    .4765365    .3139004    .3814121
---------+--------------------------------------------------------------------
    diff |            .1967317    .0336983                .1305798    .2628836
------------------------------------------------------------------------------
    diff = mean(p3nobot) - mean(p3p2bot)                          t =   5.8380
H0: diff = 0                                     Degrees of freedom =      766

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. *identical and p<0.001
. 
. 
. *Make Dummy Variables 
. gen p2bot = 1 if scenario == "p2bot"
(7,407 missing values generated)

. replace p2bot = 0 if p2bot ==.
(7,407 real changes made)

. 
. gen p3bot = 1 if scenario =="p3bot"
(9,824 missing values generated)

. replace p3bot = 0 if p3bot ==.
(9,824 real changes made)

. 
. gen p1bot = 1 if scenario == "p1bot"
(7,856 missing values generated)

. replace p1bot = 0 if p1bot ==.
(7,856 real changes made)

. 
. gen agp1 = age*p1bot
(1,560 missing values generated)

. gen agp2 = age*p2bot
(1,560 missing values generated)

. *non-logistic regressions
. quietly reg p1s1 p2bot

. quietly reg p1s1 c.age##p2bot 

. 
. quietly reg p3s1 p1bot p2bot

. quietly reg p3s1 c.age##p2bot c.age##p1bot 

. 
. 
. *logistic Regressions  THESE WERE USED
. 
. logit p1s1 p2bot , robust

Iteration 0:   log pseudolikelihood = -437.32075  
Iteration 1:   log pseudolikelihood = -402.94228  
Iteration 2:   log pseudolikelihood = -402.06263  
Iteration 3:   log pseudolikelihood = -402.06063  
Iteration 4:   log pseudolikelihood = -402.06063  

Logistic regression                                     Number of obs =    739
                                                        Wald chi2(1)  =  63.03
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -402.06063                       Pseudo R2     = 0.0806

------------------------------------------------------------------------------
             |               Robust
        p1s1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       p2bot |  -1.453786   .1831158    -7.94   0.000    -1.812687   -1.094886
       _cons |   1.801329   .1497856    12.03   0.000     1.507754    2.094903
------------------------------------------------------------------------------

. outreg2 using myreg.doc, replace ctitle(Helper Give)
myreg.doc
dir : seeout

. 
. logit p1s1 age p2bot agp2, robust

Iteration 0:   log pseudolikelihood = -435.38969  
Iteration 1:   log pseudolikelihood = -396.56264  
Iteration 2:   log pseudolikelihood =  -394.2072  
Iteration 3:   log pseudolikelihood = -394.17394  
Iteration 4:   log pseudolikelihood = -394.17391  

Logistic regression                                     Number of obs =    736
                                                        Wald chi2(3)  =  62.78
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -394.17391                       Pseudo R2     = 0.0947

------------------------------------------------------------------------------
             |               Robust
        p1s1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         age |   .0449571   .0176017     2.55   0.011     .0104583    .0794559
       p2bot |   -.088775   .7240558    -0.12   0.902    -1.507898    1.330348
        agp2 |  -.0380734    .019962    -1.91   0.056    -.0771981    .0010514
       _cons |   .1771065   .6264562     0.28   0.777    -1.050725    1.404938
------------------------------------------------------------------------------

. outreg2 using myreg.doc, append ctitle(Helper Give)
myreg.doc
dir : seeout

. 
. logit p3s1 p1bot p2bot, robust

Iteration 0:   log pseudolikelihood = -744.32255  
Iteration 1:   log pseudolikelihood = -726.17499  
Iteration 2:   log pseudolikelihood = -726.08515  
Iteration 3:   log pseudolikelihood = -726.08514  

Logistic regression                                     Number of obs =  1,133
                                                        Wald chi2(2)  =  34.73
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -726.08514                       Pseudo R2     = 0.0245

------------------------------------------------------------------------------
             |               Robust
        p3s1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       p1bot |  -.1814669   .1494489    -1.21   0.225    -.4743813    .1114475
       p2bot |  -.8807547   .1556544    -5.66   0.000    -1.185832   -.5756778
       _cons |  -.2012182   .1046894    -1.92   0.055    -.4064057    .0039693
------------------------------------------------------------------------------

. outreg2 using myreg.doc, append ctitle(Punisher Punish)
myreg.doc
dir : seeout

. logit p3s1 age p2bot agp2 p1bot agp1, robust 

Iteration 0:   log pseudolikelihood = -731.52808  
Iteration 1:   log pseudolikelihood = -711.80072  
Iteration 2:   log pseudolikelihood = -711.64818  
Iteration 3:   log pseudolikelihood = -711.64812  

Logistic regression                                     Number of obs =  1,111
                                                        Wald chi2(5)  =  37.18
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -711.64812                       Pseudo R2     = 0.0272

------------------------------------------------------------------------------
             |               Robust
        p3s1 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         age |  -.0061857   .0088785    -0.70   0.486    -.0235872    .0112159
       p2bot |  -1.790603   .5308999    -3.37   0.001    -2.831148   -.7500585
        agp2 |   .0245579   .0133615     1.84   0.066    -.0016301    .0507459
       p1bot |   -.858334   .4887392    -1.76   0.079    -1.816245    .0995771
        agp1 |   .0179301   .0123172     1.46   0.145    -.0062111    .0420714
       _cons |   .0288994   .3481824     0.08   0.934    -.6535256    .7113243
------------------------------------------------------------------------------

. outreg2 using myreg.doc, append ctitle(Punisher Punish)
myreg.doc
dir : seeout

. 
. *Graphs
. binscatter p1s1 age, by(p2bot) xtitle(Age) ytitle(Probability of Giving) title(Figure 1) subtitle(Helper bo
> ts v. people) line(qfit) savegraph(Figure1.png) replace
file Figure1.png saved as PNG format

. 
. binscatter p3s1 age, by(p1bot) xtitle(Age) ytitle(Probability of Punishing) title(Figure 2) subtitle(Punish
> er Punishing bots v. people) line(qfit) savegraph(Figure2.png) replace
file Figure2.png saved as PNG format

. 
. binscatter p3s1 age, by(p2bot) xtitle(Age) ytitle(Probability of Punishing) title(Figure 3) subtitle(Punish
> er with Beneficiary bots v people)line(qfit) savegraph(Figure3.png) replace
file Figure3.png saved as PNG format

. 
. binscatter p3s1 age, by(scenario) xtitle(Age) ytitle(Probability of Punishing) title(Figure 4) subtitle(Pun
> isher)line(qfit) savegraph(Figure4.png) replace
(126 missing values generated)
(file Figure4.png not found)
file Figure4.png saved as PNG format

. 
. 
. * Player 4 regressions - not included in discussions
. quietly reg p4p_trust_gain c.age##p1bot##p2bot##p3bot

. quietly reg p4h_trust_gain c.age##p1bot##p2bot##p3bot

. 
. quietly logit p4p_trust_gain c.age##p1bot##p2bot##p3bot

. quietly logit p4h_trust_gain c.age##p1bot##p2bot##p3bot

. 
. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\joshu\OneDrive\Documents\GitHub\ExperimentalEcon\Experiemental\GroupReplication.log
  log type:  text
 closed on:   2 Dec 2023, 13:35:13
-------------------------------------------------------------------------------------------------------------
